Repository: namhq1989/vocab-booster-mobile-app
Catalog: lib/packages/core/l10n/intl_*.arb
Languages: vi

# slogan
source: Build a stronger vocabulary and communicate more effectively with consistent practice
vi: Xây dựng vốn từ vựng mạnh mẽ và giao tiếp hiệu quả hơn với việc luyện tập thường xuyên

source: Version
vi: Phiên bản

source: Cancel
vi: Hủy

source: Start
vi: Bắt đầu

source: Leave
vi: Thoát

source: Success
vi: Thành công!

# errorCommon
source: Something went wrong. Please try again later.
vi: Đã có lỗi xảy ra, vui lòng thử lại

# errorInvalidForm
source: Form data is invalid. Please try again.
vi: Dữ liệu không đúng, vui lòng thử lại

# languageTitle
source: Language
vi: Ngôn ngữ

# languageEn
source: English
vi: Tiếng Anh

# languageVi
source: Vietnamese
vi: Tiếng Việt

# settingsTitle
source: Settings
vi: Thiết lập

# settingsAccountTitle
source: My account
vi: Tài khoản

# settingsAccountInformation
source: Information
vi: Thông tin

# settingsAccountSubscription
source: Subscription
vi: Đăng ký

# settingsAccountAchievement
source: Achievements
vi: Thành tích

# settingsPreferenceTitle
source: Preferences
vi: Thiết lập

# settingsPreferenceDarkMode
source: Dark mode
vi: Nền tối

# settingsPreferenceNotification
source: Notification
vi: Thông báo

# settingsOtherTitle
source: Other
vi: Khác

# settingsOtherPrivacy
source: Privacy Policy
vi: Chính sách bảo mật

# settingsOtherTnc
source: Terms and conditions
vi: Điều khoản sử dụng

# signInOnboardingSlide0Title
source: Boost Vocabulary Skills
vi: Tăng Cường Từ Vựng

# signInOnboardingSlide0Content
source: Enhance your English vocabulary and listening skills with our focused exercises designed to improve your language proficiency effectively
vi: Nâng cao từ vựng và kỹ năng nghe tiếng Anh của bạn với các bài tập tập trung được thiết kế để cải thiện hiệu quả trình độ ngôn ngữ của bạn

# signInOnboardingSlide1Title
source: Create and Share
vi: Sáng Tạo Và Chia Sẻ

# signInOnboardingSlide1Content
source: Compose your own sentences and share them with the community to get feedback and improve your English writing skills
vi: Tự viết câu của bạn và chia sẻ với cộng đồng để nhận phản hồi và cải thiện kỹ năng viết tiếng Anh

# signInOnboardingSlide2Title
source: Connect with Learners
vi: Kết Nối Với Người Học

# signInOnboardingSlide2Content
source: Join our community to connect with other English learners, exchange tips, and practice together for better results
vi: Tham gia cộng đồng của chúng tôi để kết nối với các người học tiếng Anh khác, trao đổi mẹo và thực hành cùng nhau để đạt kết quả tốt hơn

# signInOnboardingSlide3Title
source: Track Your Progress
vi: Theo Dõi Tiến Trình

# signInOnboardingSlide3Content
source: Monitor your vocabulary development and listening skills with our tracking tools, ensuring continuous improvement and success
vi: Theo dõi sự phát triển từ vựng và kỹ năng nghe của bạn với các công cụ theo dõi của chúng tôi, đảm bảo cải thiện liên tục và thành công

# signInOnboardingSlide4Title
source: Achieve Your Goals
vi: Đạt Được Mục Tiêu

# signInOnboardingSlide4Content
source: Set and achieve your vocabulary goals with our structured program, designed to help you succeed in mastering English
vi: Đặt ra và đạt được mục tiêu từ vựng của bạn với chương trình cấu trúc của chúng tôi, được thiết kế để giúp bạn thành công trong việc nắm vững tiếng Anh

# signInFreeText
source: It''s totally free! Just sign in and start learning!
vi: Hoàn toàn miễn phí! Đăng nhập và bắt đầu học nào!

source: Sign in with Google
vi: Đăng nhập với Google

source: Sign in with Facebook
vi: Đăng nhập với Facebook

# signInErrorCannotGetGoogleToken
source: Cannot get Google token, please try again later
vi: Lỗi đăng nhâp với Google, vui lòng thử lại

source: Sign out
vi: Đăng xuất

# signOutTitle
source: Are you sure you want to sign out?
vi: Bạn có thật sự muốn đăng xuất không?

source: Name
vi: Tên

# inputNamePlaceholder
source: Your name
vi: Tên của bạn

source: Bio
vi: Giới thiệu

# inputBioPlaceholder
source: Let''s share something about yourself
vi: Chia sẻ gì đó về bạn đi nào

source: Update
vi: Cập nhật

# userInvalidName
source: Your name must be between 2 and 64 characters, including letters and numbers
vi: Tên của bạn phải có từ 2-64 ký tự, chỉ bao gồm chữ và số

source: Mastered
vi: Thành thạo

source: For reviews
vi: Chờ ôn tập

source: Reviews
vi: Ôn tập

source: Recents
vi: Gần đây

source: Favorites
vi: Yêu thích

source: Skill
vi: Kỹ năng

source: Mode
vi: Chế độ

# profileTitle
source: Profile
vi: Cá nhân

# profileStatsCompletionTime
source: Learning duration
vi: Thời gian học

# profileStatsPoints
source: Points
vi: Điểm

# exerciseTitle
source: Exercises
vi: Bài tập

# exerciseStatusesTitle
source: Exercise Statuses
vi: Trạng thái bài tập

# exerciseStatusesDescription
source: Your progress with each exercise is tracked through different statuses. Here''s how it works:
vi: Tiến trình của bạn với mỗi bài tập được theo dõi thông qua các trạng thái khác nhau như dưới đây:

# exerciseReadyForReviewTitle
source: Ready for Review
vi: Sẵn sàng để ôn tập

# exerciseReadyForReviewDescription
source: After you successfully complete an exercise, it will be marked as ready for review. This means you''ll see it again at the next review milestone to reinforce your learning.
vi: Sau khi bạn hoàn thành một bài tập thành công, nó sẽ được đánh dấu là sẵn sàng để ôn tập. Điều này có nghĩa là bạn phải ôn tập nó vào 1 mốc thời gian ở tương lai để củng cố ghi nhớ.

# exerciseMasteredTitle
source: Mastered
vi: Thành thạo

# exerciseMasteredDescription
source: Once you achieve a streak of 5 successful completions in a row for an exercise, it will be marked as mastered. Mastered exercises still need to be reviewed periodically, but the review intervals will be much longer compared to other exercises.
vi: Khi bạn đạt được chuỗi 5 lần hoàn thành liên tiếp thành công cho một bài tập, nó sẽ được đánh dấu là thành thạo. Các bài tập đã thành thạo vẫn cần được ôn tập định kỳ, nhưng khoảng thời gian ôn tập sẽ lâu hơn nhiều so với các bài tập chưa thành thạo.

# exerciseMasteredBreak
source: If you make a mistake on an exercise, your current streak will break, and you will need to start building it again from 0
vi: Nếu bạn làm sai ở một bài tập, chuỗi hiện tại của bạn sẽ bị mất, và bạn sẽ cần bắt đầu lại từ mốc 0

# exerciseReviewMilestoneTableTitle
source: Review milestones
vi: Mốc thời gian ôn tập

# exerciseReviewMilestoneTableHeaderCompletions
source: Completions
vi: Số lần hoàn thành

# exerciseReviewMilestoneTableHeaderInterval
source: Interval
vi: Thời gian

# exerciseReviewMilestone1TimeCompletion
source: 1 time
vi: 1 lần

# exerciseReviewMilestone1TimeInterval
source: 6 hours
vi: 6 ngày

# exerciseReviewMilestone2TimeCompletion
source: 2 times
vi: 2 lần

# exerciseReviewMilestone2TimeInterval
source: 1 day
vi: 1 ngày

# exerciseReviewMilestone3TimeCompletion
source: 3 times
vi: 3 lần

# exerciseReviewMilestone3TimeInterval
source: 3 days
vi: 3 ngày

# exerciseReviewMilestone4TimeCompletion
source: 4 times
vi: 4 lần

# exerciseReviewMilestone4TimeInterval
source: 7 days
vi: 7 ngày

# exerciseReviewMilestone5TimeCompletion
source: 5 times
vi: 5 lần

# exerciseReviewMilestone5TimeInterval
source: 14 days
vi: 14 ngày

# exerciseReviewMilestoneMasteredCompletion
source: Mastered
vi: Thành thạo

# exerciseReviewMilestoneMasteredInterval
source: Every 30 days
vi: Mỗi 30 ngày

# exerciseSectionCollectionsTitle
source: Collections
vi: Bộ bài tập

# exerciseSectionCollectionsSubtitle
source: Explore collections of practice sentences
vi: Khám phá các dạng bài tập thực hành

# exerciseSectionLibraryTitle
source: Library
vi: Thư viện

# exerciseSectionLibrarySubtitle
source: Your learning exercises
vi: Bài tập của bạn

# exerciseSectionProgressTitle
source: Progress
vi: Tiến độ

# exerciseSectionProgressSubtitle
source: Daily exercises completion over the last 7 days
vi: Bài tập đã làm trong 7 ngày qua

# exerciseSectionPointsTitle
source: Points
vi: Điểm

# exerciseSectionPointsSubtitle
source: Daily points earned over the last 7 days
vi: Đã nhận được trong 7 ngày qua

# exerciseSessionSetupFor
source: Setup for
vi: Thiết lập cho

# exerciseSessionSkillVocabularySublabel
source: fill in the gaps with the correct vocabulary
vi: điền vào chỗ trống với từ vựng phù hợp

# exerciseSessionSkillListeningSublabel
source: listen to the audio and fill in the gaps
vi: nghe audio và điền vào chỗ trống

# exerciseSessionSkillSpeakingSublabel
source: speak using the mic
vi: nói qua mic

# exerciseSessionSkillValidator
source: You need to select a skill type
vi: Bạn cần chọn một loại kỹ năng

# exerciseSessionModeMultipleOptionsLabel
source: Multiple options
vi: Nhiều lựa chọn

# exerciseSessionModeMultipleOptionsSublabel
source: easier
vi: dễ hơn

# exerciseSessionModeTextInputLabel
source: Text input
vi: Nhập từ

# exerciseSessionModeTextInputSublabel
source: harder (score more points)
vi: khó hơn (được nhiều điểm hơn)

# exerciseSessionModeValidator
source: You need to select a mode type
vi: Bạn cần chọn một loại chế độ

# exeeciseSessionLeaveConfirmation
source: Are you sure you want to leave?
vi: Bạn có chắc là muốn thoát không?

# er_90_100_accuracy_1_summary
source: Awesome!
vi: Xuất sắc!

# er_90_100_accuracy_1_encouragement
source: Keep it up and stay consistent
vi: Tiếp tục giữ phong độ và cố lên

# er_90_100_accuracy_2_summary
source: Great job!
vi: Thành công rực rỡ!

# er_90_100_accuracy_2_encouragement
source: You''re doing fantastic, keep going
vi: Bạn đang làm rất tốt, cứ tiếp tục nhé

# er_90_100_accuracy_3_summary
source: You''re a star!
vi: Quá đỉnh!

# er_90_100_accuracy_3_encouragement
source: Your hard work is showing, keep it up
vi: Sự nỗ lực của bạn rất rõ ràng, tiếp tục nào

# er_90_100_accuracy_4_summary
source: Fantastic results!
vi: Kết quả tuyệt vời!

# er_90_100_accuracy_4_encouragement
source: Keep this up and aim even higher
vi: Duy trì phong độ này và nhắm cao hơn

# er_90_100_accuracy_5_summary
source: Well done!
vi: Làm tốt lắm!

# er_90_100_accuracy_5_encouragement
source: You''re really great, keep pushing forward
vi: Bạn thật sự xuất sắc, cứ tiến lên nhé

# er_75_89_accuracy_1_summary
source: Great job!
vi: Tốt lắm!

# er_75_89_accuracy_1_encouragement
source: You''re almost there, keep practicing a bit more
vi: Bạn gần đạt đỉnh rồi, cố thêm chút nữa

# er_75_89_accuracy_2_summary
source: Nice work!
vi: Giỏi lắm!

# er_75_89_accuracy_2_encouragement
source: Excellent effort, keep sharpening your skills
vi: Nỗ lực rất tốt, tiếp tục hoàn thiện kỹ năng

# er_75_89_accuracy_3_summary
source: Impressive!
vi: Ấn tượng đấy!

# er_75_89_accuracy_3_encouragement
source: You''re on the right track, stay focused
vi: Bạn đang đi đúng hướng, tiếp tục tập trung

# er_75_89_accuracy_4_summary
source: Doing well!
vi: Làm khá tốt!

# er_75_89_accuracy_4_encouragement
source: Keep practicing, you''ll hit the top soon
vi: Cứ luyện tập thêm, bạn sẽ đạt đỉnh cao

# er_75_89_accuracy_5_summary
source: Great effort!
vi: Nỗ lực đáng khen!

# er_75_89_accuracy_5_encouragement
source: You''re doing really well, aim for perfection
vi: Bạn làm rất tốt, cố đạt hoàn hảo nhé

# er_60_74_accuracy_1_summary
source: Nice try!
vi: Nỗ lực tốt!

# er_60_74_accuracy_1_encouragement
source: Keep practicing and you''ll get better
vi: Cứ luyện tập thêm và bạn sẽ cải thiện

# er_60_74_accuracy_2_summary
source: Good effort!
vi: Cố gắng khá!

# er_60_74_accuracy_2_encouragement
source: Review your mistakes and learn from them
vi: Xem lại lỗi và học hỏi từ đó

# er_60_74_accuracy_3_summary
source: Not bad!
vi: Tạm ổn!

# er_60_74_accuracy_3_encouragement
source: Stay focused and keep practicing
vi: Tập trung và tiếp tục luyện tập nhé

# er_60_74_accuracy_4_summary
source: Pretty good!
vi: Khá đấy!

# er_60_74_accuracy_4_encouragement
source: Keep at it, you''ll improve more
vi: Cứ luyện tập thêm, bạn sẽ tốt hơn

# er_60_74_accuracy_5_summary
source: Decent job!
vi: Không tệ đâu!

# er_60_74_accuracy_5_encouragement
source: Keep going, practice will bring improvement
vi: Cứ tiếp tục, luyện tập sẽ mang lại kết quả

# er_40_59_accuracy_1_summary
source: Needs work!
vi: Cần cải thiện

# er_40_59_accuracy_1_encouragement
source: Review your mistakes and try again
vi: Xem lại lỗi và thử lại nhé, kết quả sẽ tốt hơn

# er_40_59_accuracy_2_summary
source: Keep trying!
vi: Tiếp tục cố gắng!

# er_40_59_accuracy_2_encouragement
source: Focus on your weak spots and practice more
vi: Tập trung vào điểm yếu và luyện tập thêm

# er_40_59_accuracy_3_summary
source: Almost there!
vi: Sắp đạt rồi

# er_40_59_accuracy_3_encouragement
source: Practice makes perfect, keep going
vi: Luyện tập nhiều sẽ tốt hơn, tiếp tục nào

# er_40_59_accuracy_4_summary
source: Can improve!
vi: Có thể cải thiện

# er_40_59_accuracy_4_encouragement
source: Don't give up, you're making progress
vi: Đừng bỏ cuộc, bạn đang tiến bộ mà

# er_40_59_accuracy_5_summary
source: Getting better!
vi: Đang khá lên

# er_40_59_accuracy_5_encouragement
source: Keep practicing and review your errors
vi: Cứ luyện tập thêm và xem lại lỗi nhé

# er_20_39_accuracy_1_summary
source: Keep trying!
vi: Cố lên!

# er_20_39_accuracy_1_encouragement
source: Don''t give up, persistence leads to success
vi: Đừng bỏ cuộc, kiên trì sẽ dẫn đến thành công

# er_20_39_accuracy_2_summary
source: Keep going!
vi: Tiếp tục nào

# er_20_39_accuracy_2_encouragement
source: Practice more and you''ll see improvement soon
vi: Luyện tập thêm và bạn sẽ thấy tiến bộ

# er_20_39_accuracy_3_summary
source: Don''t quit!
vi: Đừng bỏ cuộc

# er_20_39_accuracy_3_encouragement
source: Every effort counts, keep pushing yourself
vi: Mỗi nỗ lực đều đáng giá, cứ tiếp tục nhé

# er_20_39_accuracy_4_summary
source: Stay focused!
vi: Giữ vững tinh thần

# er_20_39_accuracy_4_encouragement
source: You can do it, just keep practicing
vi: Bạn làm được mà, cứ luyện tập tiếp nhé

# er_20_39_accuracy_5_summary
source: Keep practicing!
vi: Luyện tập thêm

# er_20_39_accuracy_5_encouragement
source: Consistent effort will lead to better results
vi: Nỗ lực liên tục sẽ mang lại kết quả tốt

# er_00_19_accuracy_1_summary
source: Try again!
vi: Bắt đầu lại

# er_00_19_accuracy_1_encouragement
source: Practice makes perfect, keep going
vi: Luyện tập nhiều sẽ hoàn thiện, cứ cố gắng nhé

# er_00_19_accuracy_2_summary
source: Give it another go!
vi: Thử lại nhé

# er_00_19_accuracy_2_encouragement
source: Every attempt helps you learn, keep at it
vi: Mỗi lần thử là một lần học, tiếp tục nào

# er_00_19_accuracy_3_summary
source: Don''t worry!
vi: Đừng lo

# er_00_19_accuracy_3_encouragement
source: Stay positive, practice will improve your skills
vi: Hãy lạc quan, luyện tập sẽ cải thiện kỹ năng

# er_00_19_accuracy_4_summary
source: Fresh start!
vi: Khởi đầu mới

# er_00_19_accuracy_4_encouragement
source: Keep practicing, progress will come
vi: Tiếp tục luyện tập, tiến bộ sẽ đến thôi

# er_00_19_accuracy_5_summary
source: New beginning!
vi: Bắt đầu mới

# er_00_19_accuracy_5_encouragement
source: Focus on learning and keep trying your best
vi: Tập trung học hỏi và tiếp tục cố gắng hết mình
